In [1]:
import pandas as pd
import numpy as np

# <i>Series <i>

In [5]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s2= pd.Series([1,2,3,4,5],['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
ndarr = np.array([x for x in range(1,6)])
ndarr

array([1, 2, 3, 4, 5])

In [11]:
s3 = pd.Series(ndarr,['a','b','c','d','e'])
s3

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [13]:
d={'a':1, 'b':2, 'c':3}
s4=pd.Series(d)
s4

a    1
b    2
c    3
dtype: int64

In [15]:
a=7
s5 = pd.Series(a,['a','b','c'])
s5

a    7
b    7
c    7
dtype: int64

#### <i> Обращение по элементам индекса<i>

In [17]:
s6 = pd.Series([1,2,3,4,5,], ['a','b','c','d','e'])
s6[2]

3

In [18]:
s6['d']

4

In [19]:
s6[:2]

a    1
b    2
dtype: int64

In [20]:
s6[s6<=3]

a    1
b    2
c    3
dtype: int64

In [21]:
s7 = pd.Series([10,20,30,40,50],['a','b','c','d','e'])
s6+s7

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [23]:
s7*3

a     30
b     60
c     90
d    120
e    150
dtype: int64

# <i> DataFrame <i>

In [28]:
d = {'price':pd.Series([1,2,3], index = ['v1','v2','v3']),
     'count': pd.Series([10,12,7], index = ['v1','v2', 'v3'])}
df1 = pd.DataFrame(d)
df1

    price  count
v1      1     10
v2      2     12
v3      3      7

In [29]:
df1.index

Index(['v1', 'v2', 'v3'], dtype='object')

In [30]:
df1.columns

Index(['price', 'count'], dtype='object')

In [34]:
# пример с ипользованием ndarray
d2 = {'price':np.array([1,2,3]),'count':np.array([10,12,7])} 
df2 = pd.DataFrame(d, index = ['v1','v2', 'v3'])
df2

    price  count
v1      1     10
v2      2     12
v3      3      7

In [36]:
# пример с использованием списка
d2_ = {'price':[1,2,3],'count':[10,12,7]} 
df2_ = pd.DataFrame(d, index = ['v1','v2', 'v3'])
df2

    price  count
v1      1     10
v2      2     12
v3      3      7

### <i>Создание DataFrame из списка словарей<i>

In [40]:
d3 = [{'price':3, 'count':8}, {'price':4, 'count':11}]
df3 = pd.DataFrame(d3)
df3

   price  count
0      3      8
1      4     11

In [41]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   2 non-null      int64
 1   count   2 non-null      int64
dtypes: int64(2)
memory usage: 160.0 bytes

### <i>Создание DataFrame из двумерного массива<i>

In [47]:
# количество элемнтов в списках должно быть одинаковым
nda1 = np.array([[1,2,3,4],[10,20,30,40]])
df4 = pd.DataFrame(nda1)
df4

    0   1   2   3
0   1   2   3   4
1  10  20  30  40

### <i>Работа с элементами DataFrame<i>

In [48]:
d = {'price':[1,2,3],'count':[10,20,30]}
df = pd.DataFrame(d, index = ['a','b','c'])
df

   price  count
a      1     10
b      2     20
c      3     30

In [49]:
# выбор столбца
df['count']

a    10
b    20
c    30
Name: count, dtype: int64

In [50]:
# выбор строки по метке
df.loc['a']

price     1
count    10
Name: a, dtype: int64

In [51]:
# выбор строки по индексу
df.iloc[1]

price     2
count    20
Name: b, dtype: int64

In [57]:
# срез по строкам(не включая последнюю указанную в срезе)
df[1:3]

   price  count
b      2     20
c      3     30

In [59]:
# выбор сток отвечающих условию
df[df['count'] > 20]

   price  count
c      3     30

In [66]:
d_ = {'price':[1,2,3,4,5],'count':[10,20,30,40,50]}
df_ = pd.DataFrame(d_, index = ['a','b','c','d','e'])
df_

   price  count
a      1     10
b      2     20
c      3     30
d      4     40
e      5     50

In [69]:
# обращение по срезам
df_.iloc[1:4,1:2]

   count
b     20
c     30
d     40

In [83]:

s_ = pd.Series({'price':[1,2,3,4,5],'count':[10,20,30,40,50], 'weight':[11,22,33,44,55]})
s_

price          [1, 2, 3, 4, 5]
count     [10, 20, 30, 40, 50]
weight    [11, 22, 33, 44, 55]
dtype: object

In [78]:
# обращение к Series
s_[1]

[10, 20, 30, 40, 50]

In [79]:
# обращение к Series
s_[1][1]

20

In [80]:
# обращение к Series
s_['price']

[1, 2, 3, 4, 5]

In [84]:
# обращение к Series с использованеим списка индексов
s_[[0,2]]

price          [1, 2, 3, 4, 5]
weight    [11, 22, 33, 44, 55]
dtype: object

In [85]:
# обращение к Series с использованеим среза индексов
s_[1:2]

count    [10, 20, 30, 40, 50]
dtype: object

In [94]:
#Доступ с использованием callable-функции (lambda-функции)
s = pd.Series([10,20,30,40,50],['a','b','c','d','e'])
s[lambda x:x >=30]

c    30
d    40
e    50
dtype: int64

In [110]:
# логического выражения
s[s>30]

d    40
e    50
dtype: int64

In [111]:
# c использованием атрибута, например индекса 'd'
s.d

40

## <i>Доступ к данным структуры DataFrame<i>

In [103]:
d = {'price':[1,2,3,4,5],'count':[10,20,30,40,50]}
df = pd.DataFrame(d, index = ['a','b','c','d','e'])
df

   price  count
a      1     10
b      2     20
c      3     30
d      4     40
e      5     50

In [106]:
df['count']

a    10
b    20
c    30
d    40
e    50
Name: count, dtype: int64

In [105]:
df[['count','price']]

   count  price
a     10      1
b     20      2
c     30      3
d     40      4
e     50      5

In [107]:
df[lambda x:x['count']>15]

   price  count
b      2     20
c      3     30
d      4     40
e      5     50

In [109]:
df[df['price']>=3]

   price  count
c      3     30
d      4     40
e      5     50

In [112]:
# также как и с Series, например 'price'
df.price

a    1
b    2
c    3
d    4
e    5
Name: price, dtype: int64

In [117]:
df['count']

a    10
b    20
c    30
d    40
e    50
Name: count, dtype: int64

In [119]:
# Случайный набор из структур pandas
s.sample()

c    30
dtype: int64

In [120]:
# Несколько случайных элементов
s.sample(n=3)

a    10
c    30
b    20
dtype: int64

In [122]:
# Доля от общего числа объектов
s.sample(frac=0.5)

b    20
a    10
dtype: int64

In [129]:
# можем задать вероятность выпадения элементов weights
w=[0.05, 0.9, 0.1, 0.8, 0.2]
s = pd.Series([10,20,30,40,50],['a','b','c','d','e'])
s.sample(n=2, weights=w)

d    40
b    20
dtype: int64

In [130]:
# доступно также для DataFrame
df.sample()

   price  count
c      3     30

In [131]:
# можно указать ось axis=1 -это ось которая идет по названиям столбцов, axis =0 строк
df.sample(axis=1)

   count
a     10
b     20
c     30
d     40
e     50

In [132]:
df.sample(axis=0)

   price  count
b      2     20

In [133]:
df.sample(n=2)

   price  count
b      2     20
c      3     30

In [134]:
# проверим наличие элементов в списке [10,20]
s.isin([10,20])

a     True
b     True
c    False
d    False
e    False
dtype: bool

In [135]:
# проверим наличие элементов в списке [1,25,10,20]
df.isin([10,20])

   price  count
a  False   True
b  False   True
c  False  False
d  False  False
e  False  False